Revit 2027 API
ProjectInfo.Name Property
Get or Set the Project Name of the Project Information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
member Name : string with get, set
Property Value
String
Remarks
This property is used to get or set the Project Name of the Project Information.
See Also
Reference
ProjectInfo Class
Autodesk.Revit.DB Namespace